# 4.            Дана спираль:
#  21 22 23 24 25 
#  20  7  8  9 10 
#  19  6  1  2 11 
#  18  5  4  3 12 
#  17 16 15 14 13 
# Сумма чисел диагоналей = 101
# Вычислить сумму чисел диагоналей спирали 1001х1001


# 1 3 5 7 9 13 17 21 25 31 37 43 50
#  2 2 2 2 4  4  4  4  6  6  6  6

# 4005

n = 1001
ind = 2
diag_sum = 0
attempts = 0
for num in range(1, n*n + 1):
    if num % ind == 1:
        diag_sum += num
        attempts += 1
    if attempts == 4:
        attempts = 0
        ind += 2

print(f"Сумма чисел диагонали = {diag_sum}")
